stm32duino/Arduino_Core_STM32/variants/STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)/variant_DISCO_F429ZI.h
/*
 *******************************************************************************
 * Copyright (c) 2025, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#pragma once

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
// Screen on top and bottom
// P1 -Left side
#define PF4                     PIN_A0
#define PF2                     1
#define PF0                     2
#define PC14                    3
#define PE6                     4
#define PE4                     5
#define PE2                     6
#define PE0                     7
#define PB8                     8
// BOOT0                        9
#define PB6                     10
#define PB4                     11
#define PG15                    12
#define PG13                    13
#define PG11                    14
#define PG9                     15
#define PD7                     16
#define PD5                     17
#define PD3                     18
#define PD1                     19
#define PC12                    20
#define PC10                    21
#define PA14                    22
#define PA12                    23
#define PA10                    24
#define PA8                     25
#define PC8                     26
#define PC6                     27
#define PG7                     28
#define PG5                     29
// P1 - Right side
#define PF5                     PIN_A1
#define PF3                     PIN_A2
#define PF1                     32
#define PC15                    33
#define PC13                    34
#define PE5                     35
#define PE3                     36
#define PE1                     37
#define PB9                     38
#define PB7                     39
#define PB5                     40
#define PB3                     41
#define PG14                    42
#define PG12                    43
#define PG10                    44
#define PD6                     45
#define PD4                     46
#define PD2                     47
#define PD0                     48
#define PC11                    49
#define PA15                    50
#define PA13                    51
#define PA11                    52
#define PA9                     53
#define PC9                     54
#define PC7                     55
#define PG8                     56
#define PG6                     57
#define PG4                     58
// P2 - Left side
#define PF6                     PIN_A3
#define PF8                     PIN_A4
#define PF10                    PIN_A5
#define PH1                     62
#define PC1                     PIN_A6
#define PC3                     PIN_A7
#define PA1                     PIN_A8
#define PA3                     PIN_A9
#define PA5                     PIN_A10
#define PA7                     PIN_A11
#define PC5                     PIN_A12
#define PB1                     PIN_A13
#define PF12                    71
#define PF14                    72
#define PG0                     73
#define PE7                     74
#define PE9                     75
#define PE11                    76
#define PE13                    77
#define PE15                    78
#define PB11                    79
#define PB13                    80
#define PB15                    81      // Not connected SB26 OFF
#define PD9                     82
#define PD11                    83
#define PD13                    84
#define PD15                    85
#define PG3                     86
// P2 - Left side
#define PF7                     PIN_A14
#define PF9                     PIN_A15
#define PH0                     89
#define PC0                     PIN_A16
#define PC2                     PIN_A17
#define PA0                     PIN_A18
#define PA2                     PIN_A19
#define PA4                     PIN_A20
#define PA6                     PIN_A21
#define PC4                     PIN_A22
#define PB0                     PIN_A23
#define PB2                     98      // BOOT1
#define PF11                    99
#define PF13                    100
#define PF15                    101
#define PG1                     102
#define PE8                     103
#define PE10                    104
#define PE12                    105
#define PE14                    106
#define PB10                    107
#define PB12                    108
#define PB14                    109     // Not connected SB27 OFF
#define PD8                     110
#define PD10                    111
#define PD12                    112
#define PD14                    113
#define PG2                     114

// Alternate pins number
#define PA0_ALT1                (PA0  | ALT1)
#define PA0_ALT2                (PA0  | ALT2)
#define PA1_ALT1                (PA1  | ALT1)
#define PA1_ALT2                (PA1  | ALT2)
#define PA2_ALT1                (PA2  | ALT1)
#define PA2_ALT2                (PA2  | ALT2)
#define PA3_ALT1                (PA3  | ALT1)
#define PA3_ALT2                (PA3  | ALT2)
#define PA4_ALT1                (PA4  | ALT1)
#define PA5_ALT1                (PA5  | ALT1)
#define PA6_ALT1                (PA6  | ALT1)
#define PA7_ALT1                (PA7  | ALT1)
#define PA7_ALT2                (PA7  | ALT2)
#define PA7_ALT3                (PA7  | ALT3)
#define PA15_ALT1               (PA15 | ALT1)
#define PB0_ALT1                (PB0  | ALT1)
#define PB0_ALT2                (PB0  | ALT2)
#define PB1_ALT1                (PB1  | ALT1)
#define PB1_ALT2                (PB1  | ALT2)
#define PB3_ALT1                (PB3  | ALT1)
#define PB4_ALT1                (PB4  | ALT1)
#define PB5_ALT1                (PB5  | ALT1)
#define PB8_ALT1                (PB8  | ALT1)
#define PB9_ALT1                (PB9  | ALT1)
#define PB14_ALT1               (PB14 | ALT1)
#define PB14_ALT2               (PB14 | ALT2)
#define PB15_ALT1               (PB15 | ALT1)
#define PB15_ALT2               (PB15 | ALT2)
#define PC0_ALT1                (PC0  | ALT1)
#define PC0_ALT2                (PC0  | ALT2)
#define PC1_ALT1                (PC1  | ALT1)
#define PC1_ALT2                (PC1  | ALT2)
#define PC2_ALT1                (PC2  | ALT1)
#define PC2_ALT2                (PC2  | ALT2)
#define PC3_ALT1                (PC3  | ALT1)
#define PC3_ALT2                (PC3  | ALT2)
#define PC4_ALT1                (PC4  | ALT1)
#define PC5_ALT1                (PC5  | ALT1)
#define PC6_ALT1                (PC6  | ALT1)
#define PC7_ALT1                (PC7  | ALT1)
#define PC8_ALT1                (PC8  | ALT1)
#define PC9_ALT1                (PC9  | ALT1)
#define PC10_ALT1               (PC10 | ALT1)
#define PC11_ALT1               (PC11 | ALT1)

#define NUM_DIGITAL_PINS        115
#define NUM_ANALOG_INPUTS       24

// On-board LED pin number
#define LED_GREEN               PG13
#define LED_RED                 PG14
#ifndef LED_BUILTIN
  #define LED_BUILTIN           LED_GREEN
#endif

// On-board user button
#ifndef USER_BTN
  #define USER_BTN              PA0
#endif


// SPI definitions
#ifndef PIN_SPI_SS
  #define PIN_SPI_SS            PF6
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1           PF6
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2           PF6
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3           PF6
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI          PF9
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO          PF8
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK           PF7
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA          PC9
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL          PA8
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM6
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  1
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PA10
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PA9
#endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_ETH_MODULE_DISABLED)
  #define HAL_ETH_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR   Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE  Serial
  #endif
#endif /* ARDUINO_DISCO_F429ZI */
